Revit 2024 API
BuiltInFailures.SiteImportFailures.TooFarAway Property
 Imported Toposolid Points are located a large distance from the model and might not display properly. Points will be centered on the model instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId TooFarAway { get; }
Visual Basic
Public Shared ReadOnly Property TooFarAway As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ TooFarAway {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SiteImportFailures Class
Autodesk.Revit.DB Namespace